results/M2.5_0.49999999999999994/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 72.3975;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 72.3975;
    }
    sym
    {
        type            symmetry;
    }
    wedge
    {
        type            fixedValue;
        value           uniform 1e-10;
    }
    top
    {
        type            freestream;
        freestreamValue uniform 72.3975;
        value           uniform 72.3975;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 72.3975;
        value           uniform 72.3975;
    }
}


// ************************************************************************* //
